; domain
;My intial and basic cargo transport Domain
;; actions load unload and fly was not implemented by me

(define (domain cargo-transport)

    (:requirements :strips :action-costs :fluents)

    (:predicates
        (In ?obj ?place)
        (At ?obj ?place)
        (Location ?place)
        (Cargo ?obj)
        (Plane ?obj)
        (Airport ?obj)
        (Truck ?obj)

    )

    ; (:functions
    ;     (total-cost) - number
    ; )
    (:action LOAD
        :parameters (?c ?p ?a)
        :precondition (and (At ?c ?a)
            (At ?p ?a)
            (Cargo ?c)
            (Plane ?p)
            (Airport ?a))
        :effect (and (not (At ?c ?a)) (In ?c ?p))
    )

    (:action UNLOAD
        :parameters (?c ?p ?a)
        :precondition (and (In ?c ?p)
            (At ?p ?a)
            (Cargo ?c)
            (Plane ?p)
            (Airport ?a))
        :effect (and (not (In ?c ?p)) (At ?c ?a))
    )

    (:action FLY
        :parameters (?p ?from ?to)
        :precondition (and (At ?p ?from)
            (Plane ?p)
            (Airport ?from)
            (Airport ?to))
        :effect (and
            (not (At ?p ?from))
            (At ?p ?to)
            ; (increase (total-cost) 5)
        )
    )
    (:action Drive
        :parameters (?t ?from ?to)
        :precondition (and(At ?t ?from)
            (Truck ?t)
            (Location ?from)
            (Location ?to))
        :effect (and
            (not (At ?t ?from))
            (At ?t ?to)
            ; (increase (total-cost) 5)
        )
    )
    ;; I am keeping the load and unload for planes and trucks seperate for now might concatinate them later (:action Pick-up
    (:action Pick-up
        :parameters (?c ?t ?l)
        :precondition (and (At ?c ?l)
            (At ?c ?l)
            (At ?t ?l)
            (Cargo ?c)
            (Truck ?t)
            (Location ?l)

        )
        :effect (and (not (At ?c ?l)) (In ?c ?t))
    )
    (:action drop
        :parameters (?c ?t ?l)
        :precondition (and (In ?c ?t)
            (At ?t ?l)
            (Cargo ?c)
            (Truck ?t)
            (Location ?l))
        :effect (and (not (In ?c ?t)) (At ?c ?l))
    )
)

; problem
(define (problem problem3)
    (:domain cargo-transport)
    (:objects
        cargo1 cargo2 cargo3 cargo4 truck1 truck2 plane1 plane2 Manchester Birmingham London New-york

    )

    (:init

        (cargo cargo3)
        (Cargo cargo4)
        (Truck truck1)
        (Truck truck2)
        (Location Birmingham)
        (Location Manchester)
        (Cargo cargo1)
        (Cargo cargo2)
        (Plane plane1)
        (Plane plane2)
        (Airport London)
        (Airport New-york)

        (At cargo3 Birmingham)
        (At cargo4 Manchester)
        (At truck1 Birmingham)
        (At truck2 Manchester)

        (At cargo1 New-york)
        (At cargo2 London)
        (At plane1 New-york)
        (At plane2 London)
        ; (= (distance Birmingham Manchester) 10)
        ; (= (distance A C) 35)
    )
    (:goal
        (and (At cargo3 Manchester) (At cargo4 Birmingham) (At cargo1 London) (At cargo2 New-york))
    )
)

; plan
1. (load cargo2 plane2 london)
   deleted: (at cargo2 london)
   added: (in cargo2 plane2)
   goals met: 0 of 4
2. (fly plane2 london new-york)
   deleted: (at plane2 london)
   added: (at plane2 new-york)
   goals met: 0 of 4
3. (unload cargo2 plane2 new-york)
   deleted: (in cargo2 plane2)
   added: (at cargo2 new-york)
   goals met: 1 of 4
4. (pick-up cargo4 truck2 manchester)
   deleted: (at cargo4 manchester)
   added: (in cargo4 truck2)
   goals met: 1 of 4
5. (drive truck2 manchester birmingham)
   deleted: (at truck2 manchester)
   added: (at truck2 birmingham)
   goals met: 1 of 4
6. (drop cargo4 truck2 birmingham)
   deleted: (in cargo4 truck2)
   added: (at cargo4 birmingham)
   goals met: 2 of 4
7. (pick-up cargo3 truck1 birmingham)
   deleted: (at cargo3 birmingham)
   added: (in cargo3 truck1)
   goals met: 2 of 4
8. (drive truck1 birmingham manchester)
   deleted: (at truck1 birmingham)
   added: (at truck1 manchester)
   goals met: 2 of 4
9. (drop cargo3 truck1 manchester)
   deleted: (in cargo3 truck1)
   added: (at cargo3 manchester)
   goals met: 3 of 4
10. (load cargo1 plane2 new-york)
   deleted: (at cargo1 new-york)
   added: (in cargo1 plane2)
   goals met: 3 of 4
11. (fly plane2 new-york london)
   deleted: (at plane2 new-york)
   added: (at plane2 london)
   goals met: 3 of 4
12. (unload cargo1 plane2 london)
   deleted: (in cargo1 plane2)
   added: (at cargo1 london)
   goals met: 4 of 4
